First/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтандартнаяУпаковка</name>
    <type>
      <types>CatalogRef.Упаковки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
</mdclass:Catalog>

First/src/InformationRegisters/ЦеныПродажиНоменклатуры/ЦеныПродажиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПродажиНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

First/src/Catalogs/Номенклатура/ManagerModule.bsl
Процедура СформироватьПрайслист(ТабличныйДокумент, Ссылки) Экспорт
	
	Макет = ПолучитьМакет("ПрайсЛист");
	
	// Получаем область заголовка
	//ТабличнаяЧастьЗаголовок = Макет.ПолучитьОбласть("ТабличнаяЧастьЗаголовок");
	ТабличнаяЧастьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабличныйДокумент.Вывести(ТабличнаяЧастьЗаголовок);

	// Получаем область шапки и макета по имени
	Шапка = Макет.ПолучитьОбласть("Шапка");
	// Заполняем параметр Дата
	Шапка.Параметры.Дата = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	// Выводим область в документ
	ТабличныйДокумент.Вывести(Шапка);
	
	// Получаем область строк для формирования табличной части в цикле
	ТабличнаяЧастьСтрока = Макет.ПолучитьОбласть("Номенклатура");
	
	Для каждого СсылкаНоменклатура из Ссылки Цикл
		ТабличнаяЧастьСтрока.Параметры.Номенклатура = СсылкаНоменклатура; 
		ТабличнаяЧастьСтрока.Параметры.Цена = ПолучитьЦенуНоменклатуры(СсылкаНоменклатура); 
		ТабличныйДокумент.Вывести(ТабличнаяЧастьСтрока);
	КонецЦикла;
	        
КонецПроцедуры

Функция ПолучитьЦенуНоменклатуры(СсылкаНоменклатура)
	
	Отбор = Новый Структура("Номенклатура", СсылкаНоменклатура);
	ПоследняяЗапись = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	Возврат ПоследняяЗапись.Цена;
	
КонецФункции
